RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Include/gd32f5xx_syscfg.h
/* function configuration */
/* configure the boot mode */
void syscfg_bootmode_config(uint8_t syscfg_bootmode);
/* configure FMC memory mapping swap */
void syscfg_fmc_swap_config(uint32_t syscfg_fmc_swap);
/* configure the EXMC swap */
void syscfg_exmc_swap_config(uint32_t syscfg_exmc_swap); 
/* configure the GPIO pin as EXTI Line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);
/* configure the PHY interface for the ethernet MAC */
void syscfg_enet_phy_interface_config(uint32_t syscfg_enet_phy_interface);
/* configure the I/O compensation cell */
void syscfg_compensation_config(uint32_t syscfg_compensation);
/* get Compensation cell ready flag */
FlagStatus syscfg_cps_cell_ready_get(void);
/* get ecc err bits */
uint32_t syscfg_ecc_err_bits_get(syscfg_ecc_enum ecc_type);
/* get ecc address */
uint32_t syscfg_ecc_address_get(syscfg_ecc_enum ecc_type);

/* interrupt & flag functions */
/* get SYSCFG flag state */
FlagStatus syscfg_flag_get(syscfg_flag_enum flag);
/* clear SYSCFG flag state */
void syscfg_flag_clear(syscfg_flag_enum flag);
/* enable SYSCFG interrupt */
void syscfg_interrupt_enable(syscfg_interrupt_enum interrupt);
/* disable SYSCFG interrupt */
void syscfg_interrupt_disable(syscfg_interrupt_enum interrupt);
/* get SYSCFG interrupt flag state */
FlagStatus syscfg_interrupt_flag_get(syscfg_interrupt_flag_enum flag);
/* clear SYSCFG interrupt flag state */
void syscfg_interrupt_flag_clear(syscfg_interrupt_flag_enum flag);

#endif /* GD32F5XX_SYSCFG_H */
